gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c


#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_EventLIB.h"
#include "../DL698/RM_RxDATA.h"

#include "../Calculate/Calculate.h"
#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"





//扩展的数据类型
#define DataType_date_time_5byte			254  //645里的YYMMDDhhmm 格式的转date_time_s格式
#define DataType_Unbalance					253 //电压，电流不平衡 XXXX.XX转成 long-unsigned格式
#define DataType_double_long_unsigned_3byte 252 //645里的NNNNNN格式 转成698的double_long_unsigned
#define DataType_date_time_s_null			251	//事件没有结束时间，但是698又要求了，上传数据无效的date_time_s
#define DataType_double_long_unsigned_2byte 250 //645里的NNNNNN格式 转成698的double_long_unsigned

#define NO_SUCH_OAD 0xfefefefe
//电能表事件采集库
typedef __packed struct
{
	u32 OAD;//事件OAD
	u32 DInum;//对应抄读645次数的DI,0表示空
	u8 DInum_offset;//抄读的645次数在帧中偏移字节数
	u8 DInum_byte;//抄读的645次数有效字节数
	u32* DL645;//对应645最近1次事件的DI,0表示空
	u8 LEN_DL645;//对应DL645表总长度字节数
}RM_EventLIB_typedef;

typedef __packed struct
{
	u32 DI;//对应645最近1次事件的DI,0表示空
	u32* OAD645;//对应645数据项的OAD顺序列表
	u16 LEN_OAD645;//对应645数据项的OAD顺序列表总字节数
}RM_EventLIB_DL645_typedef;

typedef __packed struct
{
	u32 OAD;//数据项对应698的OAD
	u8 Byte;//数据项在645帧数据域去除数据标识之后的起始位置
	u8 DataType;//数据项对应698的数据类型
}RM_EventLIB_OAD645_typedef;


//基本上的事件总次数都是用这个参数
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_3[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	0,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};

const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_1[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	0,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_2[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_3[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	6,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_4[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	9,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_5[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	12,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_20220200_03120000_6[]=//645数据项的OAD顺序列表
{
	0x20220200,//事件序号
	15,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_3byte, //转成698之后的数据类型
};

//电能表掉电事件3011
//电能表正向有功需量超限事件3009
//电能表反向有功需量超限事件300a
//电能表无功需量超限事件300b
//电能表编程事件 3012
//事件清零事件 3015
//电能表时段编程事件3017
//电能表节假日编程事件3021
//3023 3029 302C 302E 302F
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_standard[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型
};

////失压3000,欠压3001，过压3002，断项3003
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30000600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//事件发生时刻
	0,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s, //转成698之后的数据类型

	0x00102201,//,//事件发生时刻正向有功总电能
	6,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
	
	0x00202201,//--事件发生时刻反向有功总电能
	10,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
	
	0x00302201,//--事件发生时刻组合无功1总电能
	14,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00402201,//--事件发生时刻组合无功2总电能
	18,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00112201,//--事件发生时刻A相正向有功电能
	22,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00212201,//--事件发生时刻A相反向有功电能
	26,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00312201,//--事件发生时刻A相组合无功1电能
	30,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00412201,//--事件发生时刻A相组合无功2电能
	34,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00122201,//--事件发生时刻B相正向有功电能
	51,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00222201,//--事件发生时刻B相反向有功电能
	55,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00322201,//--事件发生时刻B相组合无功1电能
	59,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00422201,//--事件发生时刻B相组合无功2电能
	63,		//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00132201,//--事件发生时刻C相正向有功电能
	80,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00232201,//--事件发生时刻C相反向有功电能
	84,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00332201,//--事件发生时刻C相组合无功1电能
	88,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x00432201,//--事件发生时刻C相组合无功2电能
	92,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned, //转成698之后的数据类型
			
	0x20002200,//--事件发生时刻电压
	3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻电压
		38,			//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型
		0,//--事件发生时刻电压
		67,			//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型
		0,//--事件发生时刻电压
		96,			//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型

			
	 0x20012200,//--事件发生时刻电流
	 3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_array,//转成698之后的数据类型
		 0,//--事件发生时刻电流
		 40,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻电流
		 69,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻电流
		 98,		//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
			
	 0x20042200,//--事件发生时刻有功功率
	 3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_array,//转成698之后的数据类型
		 0,//--事件发生时刻有功功率
		 43,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻有功功率
		 72,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻有功功率
		 101, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
					
	 0x20052200,//--事件发生时刻无功功率
	 3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_array,//转成698之后的数据类型
		 0,//--事件发生时刻无功功率
		 46,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻无功功率
		 75,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
		 0,//--事件发生时刻无功功率
		 104, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_double_long, //转成698之后的数据类型
					
	 0x200A2200,//--事件发生时刻功率因数
	 3,			//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_array,//转成698之后的数据类型
		 0,//--事件发生时刻功率因数
		 49,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_long,//转成698之后的数据类型
		 0,//--事件发生时刻功率因数
		 78,			//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_long,//转成698之后的数据类型
		 0,//--事件发生时刻功率因数
		 107, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		 DataType_long,//转成698之后的数据类型
		
	0x20296200,//--事件发生期间安时值
	4,			//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生期间安时值
		109, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
		0,//--事件发生期间安时值
		113, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
		0,//--事件发生期间安时值
		117, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
		0,//--事件发生期间安时值
		121, 		//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型

//结束时刻	125
	
	 0x20200200,//--事件结束时刻
	 125, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_date_time_s,//转成698之后的数据类型
				
	 0x00108201,//--事件结束后正向有功总电能
	 131, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00208201,//--事件结束后反向有功总电能
	 135, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00308201,//--事件结束后组合无功1总电能
	 139, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
