gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
	 0x00408201,//--事件结束后组合无功2总电能
	 143, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00118201,//--事件结束后A相正向有功电能
	 147, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00218201,//--事件结束后A相反向有功电能
	 151, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00318201,//--事件结束后A相组合无功1电能
	 155, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00418201,//--事件结束后A相组合无功2电能
	 159, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00128201,//--事件结束后B相正向有功电能
	 163, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00228201,//--事件结束后B相反向有功电能
	 167, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00328201,//--事件结束后B相组合无功1电能
	 171, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00428201,//--事件结束后B相组合无功2电能
	 175, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00138201,//--事件结束后C相正向有功电能
	 179, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00238201,//--事件结束后C相反向有功电能
	 183, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00338201,//--事件结束后C相组合无功1电能
	 187, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
			
	 0x00438201,//--事件结束后C相组合无功2电能
	 191, 		//对应数据在645帧数据域去除数据标识之后的起始位置
	 DataType_double_long_unsigned, //转成698之后的数据类型
	
};
//失流3004  过流3005 断流3006
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30040600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x00102201,//--事件发生时刻正向有功总电能
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00202201,//--事件发生时刻反向有功总电能
	10			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00302201,//--事件发生时刻组合无功1总电能
	14			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00402201,//--事件发生时刻组合无功2总电能
	18			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00112201,//--事件发生时刻A相正向有功电能
	22			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00212201,//--事件发生时刻A相反向有功电能
	26			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00312201,//--事件发生时刻A相组合无功1电能
	30			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00412201,//--事件发生时刻A相组合无功2电能
	34			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00122201,//--事件发生时刻B相正向有功电能
	51			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00222201,//--事件发生时刻B相反向有功电能
	55			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00322201,//--事件发生时刻B相组合无功1电能
	59			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00422201,//--事件发生时刻B相组合无功2电能
	63			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00132201,//--事件发生时刻C相正向有功电能
	80			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00232201,//--事件发生时刻C相反向有功电能
	84			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00332201,//--事件发生时刻C相组合无功1电能
	88			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00432201,//--事件发生时刻C相组合无功2电能
	92			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x20002200,//--事件发生时刻电压
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻电压
		38 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型
		0,//--事件发生时刻电压
		67 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型
		0,//--事件发生时刻电压
		96 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long_unsigned,//转成698之后的数据类型


	0x20012200,//--事件发生时刻电流
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻电流
		40 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻电流
		69 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻电流
		98 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		
	0x20042200,//--事件发生时刻有功功率
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻有功功率
		43 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻有功功率
		72 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻有功功率
		101		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
				
	0x20052200,//--事件发生时刻无功功率
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻无功功率
		46 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻无功功率
		75 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,//--事件发生时刻无功功率
		104		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
				
	0x200A2200,//--事件发生时刻功率因数
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生时刻功率因数
		49 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long,//转成698之后的数据类型
		0,//--事件发生时刻功率因数
		78 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long,//转成698之后的数据类型
		0,//--事件发生时刻功率因数
		107		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_long,//转成698之后的数据类型


	//结束时刻	109

	0x20200200,//--事件结束时刻
	109 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
			
	0x00108201,//--事件结束后正向有功总电能
	115 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00208201,//--事件结束后反向有功总电能
	119 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00308201,//--事件结束后组合无功1总电能
	123 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00408201,//--事件结束后组合无功2总电能
	127 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
