gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
	0x00118201,//--事件结束后A相正向有功电能
	131 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00218201,//--事件结束后A相反向有功电能
	135 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00318201,//--事件结束后A相组合无功1电能
	139 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00418201,//--事件结束后A相组合无功2电能
	143 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00128201,//--事件结束后B相正向有功电能
	147 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00228201,//--事件结束后B相反向有功电能
	151 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00328201,//--事件结束后B相组合无功1电能
	155 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00428201,//--事件结束后B相组合无功2电能
	159 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00138201,//--事件结束后C相正向有功电能
	163 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00238201,//--事件结束后C相反向有功电能
	167 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00338201,//--事件结束后C相组合无功1电能
	171 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00438201,//--事件结束后C相组合无功2电能
	175 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
};
//潮流反向3007 过载3008 电压逆向序300F
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30070600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x00102201,//--事件发生时刻正向有功总电能
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00202201,//--事件发生时刻反向有功总电能
	10 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00302201,//--事件发生时刻组合无功1总电能
	14 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00402201,//--事件发生时刻组合无功2总电能
	18 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00112201,//--事件发生时刻A相正向有功电能
	22 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00212201,//--事件发生时刻A相反向有功电能
	26 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00312201,//--事件发生时刻A相组合无功1电能
	30 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00412201,//--事件发生时刻A相组合无功2电能
	34 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00122201,//--事件发生时刻B相正向有功电能
	38 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00222201,//--事件发生时刻B相反向有功电能
	42 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00322201,//--事件发生时刻B相组合无功1电能
	46 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00422201,//--事件发生时刻B相组合无功2电能
	50 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00132201,//--事件发生时刻C相正向有功电能
	54 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00232201,//--事件发生时刻C相反向有功电能
	58 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00332201,//--事件发生时刻C相组合无功1电能
	62 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00432201,//--事件发生时刻C相组合无功2电能
	66 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	//结束时刻	70

	0x20200200,//--事件结束时刻
	70 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
			
	0x00108201,//--事件结束后正向有功总电能
	76 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00208201,//--事件结束后反向有功总电能
	80 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00308201,//--事件结束后组合无功1总电能
	84 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00408201,//--事件结束后组合无功2总电能
	88 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00118201,//--事件结束后A相正向有功电能
	92 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00218201,//--事件结束后A相反向有功电能
	96 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00318201,//--事件结束后A相组合无功1电能
	100		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00418201,//--事件结束后A相组合无功2电能
	104		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00128201,//--事件结束后B相正向有功电能
	108		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00228201,//--事件结束后B相反向有功电能
	112		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00328201,//--事件结束后B相组合无功1电能
	116		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00428201,//--事件结束后B相组合无功2电能
	120		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00138201,//--事件结束后C相正向有功电能
	124		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00238201,//--事件结束后C相反向有功电能
	128		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00338201,//--事件结束后C相组合无功1电能
	132		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00438201,//--事件结束后C相组合无功2电能
	136		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
};

//正向有功需量超限3009 反向有功需量超限300a  300b无功需量超限
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30090600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
};
//功率因数超下限事件
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_300C0600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x00102201,//--事件发生时刻正向有功总电能
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00202201,//--事件发生时刻反向有功总电能
	10 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00302201,//--事件发生时刻组合无功1
	14 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
