gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
	0x00402201,//--事件发生时刻组合无功2
	18 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	//结束时刻	22

	0x20200200,//--事件结束时刻
	22 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x00108201,//--事件结束后正向有功电能
	28 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00208201,//--事件结束后反向有功总电能
	32 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00308201,//--事件结束后组合无功1
	36 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00408201,//--事件结束后组合无功2
	40 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
};
//电能表全失压事件
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_300D0600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	9 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0X20012200,//--事件发生前电流
	1,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--事件发生前电流
		6 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long,//转成698之后的数据类型
};
//电能表辅助电源掉电事件
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_300E0600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	6 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
};

const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30110600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
};


//电表清零记录
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30130600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x00102201,//--电表清零前正向有功总电能
	10 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00202201,//--电表清零前反向有功总电能
	14 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00502201,//--电表清零前第一象限无功总电能
	18 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00602201,//--电表清零前第二象限无功总电能
	22 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00702201,//--电表清零前第三象限无功总电能
	26 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00802201,//--电表清零前第四象限无功总电能
	30 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00112201,//--电表清零前A相正向有功电能
	34 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00212201,//--电表清零前A相反向有功电能
	38 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00512201,//--电表清零前A相第一象限无功电能
	42 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00612201,//--电表清零前A相第二象限无功电能
	46 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00712201,//--电表清零前A相第三象限无功电能
	50 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00812201,//--电表清零前A相第四象限无功电能
	54 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00122201,//--电表清零前B相正向有功电能
	58 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00222201,//--电表清零前B相反向有功电能
	62 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00522201,//--电表清零前B相第一象限无功电能
	66 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00622201,//--电表清零前B相第二象限无功电能
	70 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00722201,//--电表清零前B相第三象限无功电能
	74 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00822201,//--电表清零前B相第四象限无功电能
	78 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00132201,//--电表清零前C相正向有功电能
	82 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00232201,//--电表清零前C相反向有功电能
	86 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00532201,//--电表清零前C相第一象限无功电能
	90 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00632201,//--电表清零前C相第二象限无功电能
	94 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00732201,//--电表清零前C相第三象限无功电能
	98 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00832201,//--电表清零前C相第四象限无功电能
	102			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
};
//电表需量清零记录
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30140600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x10102201,//--需量清零前正向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		10 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		13 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10202201,//--需量清零前反向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		18 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		21 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10502201,//--需量清零前第一象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		26 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		29 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10602201,//--需量清零前第二象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		34 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		37 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

