gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
	0x10702201,//--需量清零前第三象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		42 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		45 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10802201,//--需量清零前第四象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		50 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		53 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10112201,//--需量清零前A相正向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		58 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		61 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10212201,//--需量清零前A相反向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		66 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		69 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10512201,//--需量清零前A相第一象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		74 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		77 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10612201,//--需量清零前A相第二象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		82 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		85 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10712201,//--需量清零前A相第三象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		90 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		93 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10812201,//--需量清零前A相第四象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		98 		,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		101			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10122201,//--需量清零前B相正向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		106			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		109			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10222201,//--需量清零前B相反向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		114			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		117			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10522201,//--需量清零前B相第一象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		122			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		125			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10622201,//--需量清零前B相第二象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		130			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		133			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10722201,//--需量清零前B相第三象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		138			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		141			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10822201,//--需量清零前B相第四象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		146			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		149			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10132201,//--需量清零前C相正向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		154			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		157			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10232201,//--需量清零前C相反向有功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		162			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		165			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10532201,//--需量清零前C相第一象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		170			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		173			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10632201,//--需量清零前C相第二象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		178			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		181			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型

	0x10732201,//--需量清零前C相第三象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		186			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		189			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte,//转成698之后的数据类型

	0x10832201,//--需量清零前C相第四象限无功总最大需量及发生时间
	2			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure ,//转成698之后的数据类型
		0,
		194			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long ,//转成698之后的数据类型
		0,
		197			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_date_time_5byte ,//转成698之后的数据类型
};
//电能表校时事件3016
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30160600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型
	
	0x40002200,//--校时前时间
	4			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x40008200,//--校时后时间
	10			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
	
};
//电能表时区编程事件3018
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30180600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	
	0x40142200,//--时区编程前当前套时区表
	14			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			12			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			11			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			10			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			15			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			14			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			13			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			18			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			17			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			16			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			21			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			20			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			19			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			24			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			23			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			22			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			27			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			26			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			25			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			30			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			29			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			28			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			33			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			32			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			31			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			36			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			35			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			34			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			39			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			38			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			37			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			42			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			41			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			40			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			45			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			44			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			43			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			48			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			47			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			46			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			51			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			50			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			49			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型

	0x40152200,//--时区编程前备用套时区表
	14			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			54			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			53			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			52			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			57			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			56			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			55			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			60			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			59			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			58			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			63			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			62			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			61			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			66			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			65			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			64			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			69			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			68			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			67			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			72			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			71			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			70			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			75			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			74			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			73			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			78			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			77			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			76			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			81			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			80			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			79			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			84			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			83			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			82			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			87			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			86			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			85			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			90			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			89			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			88			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--时区编程前当前套时区表
		3			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			93			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			92			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			91			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型

