gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
};
//电能表周休日编程事件3019
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30190600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x40132200,//--编程前周休日釆用的日时段表号
	11			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_unsigned,//转成698之后的数据类型
};
//电能表结算日编程事件301A
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_301A0600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x41162200,//--编程前结算日
	3			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_array,//转成698之后的数据类型
		0,//--编程前结算日
		2			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			11			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			10			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--编程前结算日
		2			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			13			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			12			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
		0,//--编程前结算日
		2			,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_structure,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			15			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型
			0,//--时区编程前当前套时区表
			14			,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_unsigned,//转成698之后的数据类型

};

//301b 开表盖    301c开端钮盖
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_301B0600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x20200200,//--事件结束时刻
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型


	0x00102201,//--开表盖前正向有功总电能、
	12 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00202201,//--开表盖前反向有功总电能、
	16 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00502201,//--开表盖前第一象限无功总电能
	20 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00602201,//--开表盖前第二象限无功总电能
	24 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00702201,//--开表盖前第三象限无功总电能
	28 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00802201,//--开表盖前第四象限无功总电能 
	32 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00108201,//--开表盖后正向有功总电能、
	36 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00208201,//--开表盖后反向有功总电能、
	40 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00508201,//--开表盖后第一象限无功总电能
	44 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00608201,//--开表盖后第二象限无功总电能
	48 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00708201,//--开表盖后第三象限无功总电能
	52 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00808201,//--开表盖后第四象限无功总电能
	56 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

};
//电压不平衡301D，电流不平衡 301E 电流严重不平衡302D
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_301D0600[]=//645数据项的OAD顺序列表
{
	0x201e0200,//--事件发生时刻
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s ,//转成698之后的数据类型

	0x00102201,//--事件发生时刻正向有功总电能
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00202201,//--事件发生时刻反向有功总电能
	10 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x00302201,//--事件发生时刻组合无功1总电能
	14 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00402201,//--事件发生时刻组合无功2总电能
	18 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00112201,//--事件发生时刻A相正向有功电能
	22 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00212201,//--事件发生时刻A相反向有功电能
	26 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00312201,//--事件发生时刻A相组合无功1电能
	30 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00412201,//--事件发生时刻A相组合无功2电能
	34 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00122201,//--事件发生时刻B相正向有功电能
	51 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00222201,//--事件发生时刻B相反向有功电能
	55 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00322201,//--事件发生时刻B相组合无功1电能
	59 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00422201,//--事件发生时刻B相组合无功2电能
	63 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00132201,//--事件发生时刻C相正向有功电能
	80 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00232201,//--事件发生时刻C相反向有功电能
	84 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00332201,//--事件发生时刻C相组合无功1电能
	88 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00432201,//--事件发生时刻C相组合无功2电能
	92 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

	0x20276200,//--事件发生期间电流不平衡率  301D-----2026  301E---2027
	96 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_Unbalance ,//转成698之后的数据类型

	//结束时刻	99
	0x20200200,//--事件结束时刻
	99 		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
			
	0x00108201,//--事件结束后正向有功总电能
	105		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00208201,//--事件结束后反向有功总电能
	109		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00308201,//--事件结束后组合无功1总电能
	113		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00408201,//--事件结束后组合无功2总电能
	117		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
