gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
	0x00118201,//--事件结束后A相正向有功电能
	121		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00218201,//--事件结束后A相反向有功电能
	125		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00318201,//--事件结束后A相组合无功1电能
	129		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00418201,//--事件结束后A相组合无功2电能
	133		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00128201,//--事件结束后B相正向有功电能
	137		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00228201,//--事件结束后B相反向有功电能
	141		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00328201,//--事件结束后B相组合无功1电能
	145		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00428201,//--事件结束后B相组合无功2电能
	149		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00138201,//--事件结束后C相正向有功电能
	153		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00238201,//--事件结束后C相反向有功电能
	157		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00338201,//--事件结束后C相组合无功1电能
	161		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型
		
	0x00438201,//--事件结束后C相组合无功2电能
	165		,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned ,//转成698之后的数据类型

};
//电能表拉闸事件事件301F
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_301F0600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0 	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x00102201,//--拉闸前正向有功总电能、
	10	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

	0x00202201,//--拉闸前反向有功总电能、
		14	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00502201,//--拉闸前第一象限无功总电能
		18	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00602201,//--拉闸前第二象限无功总电能
		22	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00702201,//--拉闸前第三象限无功总电能
		26	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00802201,//--拉闸前第四象限无功总电能
		30	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00108201,//--拉闸后正向有功总电能、
		10	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00208201,//--拉闸后反向有功总电能、
		14	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00508201,//--拉闸后第一象限无功总电能
		18	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00608201,//--拉闸后第二象限无功总电能
		22	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00708201,//--拉闸后第三象限无功总电能
		26	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00808201,//--拉闸后第四象限无功总电能
		30	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型

};
//电能表合闸事件3020
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30200600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0 	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x00102201,//--拉闸前正向有功总电能、
	10	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

	0x00202201,//--拉闸前反向有功总电能、
		14	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00502201,//--拉闸前第一象限无功总电能
		18	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00602201,//--拉闸前第二象限无功总电能
		22	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00702201,//--拉闸前第三象限无功总电能
		26	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00802201,//--拉闸前第四象限无功总电能
		30	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00108201,//--拉闸后正向有功总电能、
		10	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00208201,//--拉闸后反向有功总电能、
		14	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00508201,//--拉闸后第一象限无功总电能
		18	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00608201,//--拉闸后第二象限无功总电能
		22	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00708201,//--拉闸后第三象限无功总电能
		26	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型
	0x00808201,//--拉闸后第四象限无功总电能
		30	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型

};

//电能表有功组合方式编程事件3022
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30220600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0 	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型


	0x41122200,//--编程前有功组合方式特征字
	11	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_bit_string,//转成698之后的数据类型
};
/*
//电能表无功组合方式编程事件3023==========???????有问题的
const u32 RM_EventLIB_OAD698_30230600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0 	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型
	
	0x41132200,//--编程前无功组合方式1特征字
	11	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_bit_string,//转成698之后的数据类型

	0x41142200,//--编程前无功组合方式2特征字
	11	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_bit_string,//转成698之后的数据类型	
};*/
//电能表费率参数编程事件3024
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30240600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型 
 
	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型 
	
	0x40182200,//--编程前当前套费率电价
	0XFF	,//对应数据在645帧数据域去除数据标识之后的起始位置------这个特殊处理
	DataType_array,//转成698之后的数据类型 
		0,//--编程前当前套费率电价
		0XFF	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型 
	0x40192200,//--编程前备用套费率电价
	0XFF	,//对应数据在645帧数据域去除数据标识之后的起始位置------这个特殊处理
	DataType_array,//转成698之后的数据类型 
		0,//--编程前当前套费率电价
		0XFF	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_double_long_unsigned,//转成698之后的数据类型 

