gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
};
//电能表阶梯表编程事件3025
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30250600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型 
 
	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型 

	0x401A2200,//--编程前当前套阶梯电价
	3	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure,//转成698之后的数据类型 
		0,//--编程前当前套阶梯电价
		6	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			10	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			14	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			18	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			22	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			26	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			30	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
		0,//--编程前当前套阶梯电价
		7	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			34	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			38	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			42	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			46	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			50	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			54	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			58	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型 	
		0,//--编程前当前套阶梯电价
		4	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				64	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				63	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				62	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				67	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				66	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				65	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				70	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				69	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				68	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				73	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				72	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
				0,//--编程前当前套阶梯电价
				71	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型 	
	0x401B2200,//--编程前备用套阶梯电价
	3	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_structure,//转成698之后的数据类型 
		0,//--编程前当前套阶梯电价
		6	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			74	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			78	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			82	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			86	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			90	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			94	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
		0,//--编程前当前套阶梯电价
		7	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			98	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			102	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			106	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			110	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			114	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			118	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			122	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_double_long_unsigned,//转成698之后的数据类型	
		0,//--编程前当前套阶梯电价
		4	,//对应数据在645帧数据域去除数据标识之后的起始位置
		DataType_array,//转成698之后的数据类型 
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				128	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				127	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				126	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				131	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				130	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				129	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				134	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				133	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				132	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
			0,//--编程前当前套阶梯电价
			3	,//对应数据在645帧数据域去除数据标识之后的起始位置
			DataType_structure,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				137	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				136	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	
				0,//--编程前当前套阶梯电价
				135	,//对应数据在645帧数据域去除数据标识之后的起始位置
				DataType_unsigned,//转成698之后的数据类型	

