gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
};
//电能表密钥更新事件3026
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30260600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型 
 
	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型 


	/*0xF1002400,//--更新前的密钥状态字
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型 
	*/
};
//电能表异常插卡事件3027 
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30270600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型 
 
	0x20200200,//事件结束时间
	0	,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型 


};

//电能表购电记录3028
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30280600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_5byte,//转成698之后的数据类型
	
	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

	0x202C8202,//--购电后购电次数
	5			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned_2byte,//转成698之后的数据类型
	
	0x202C2201,//--购电前剩余金额
	11			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x202E2200,//--购电前累计购电金额
	7			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x202C8201,//--购电后剩余金额
	15			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x202E8200,//--购电后累计购电金额
	19			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

};
//电能表购电记录3029
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30290600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_5byte,//转成698之后的数据类型
	
	0x20200200,//事件结束时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s_null,//转成698之后的数据类型

};

//恒定磁场干扰事件302A
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_302A0600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
	
	0x20200200,//事件结束时间
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型


	0x00102201,//--恒定磁场干扰事件前正向有功总电能
	12			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x00202201,//--恒定磁场干扰事件前反向有功总电能
	16			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x00108201,//--恒定磁场干扰事件后正向有功总电能
	20			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
	
	0x00208201,//--恒定磁场干扰事件后反向有功总电能
	24			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

};
//负荷开关误动作事件302B
const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_302B0600[]=//标准698的OAD列表
{
	0x201E0200,//事件发生时间
	0			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型
	
	0x20200200,//事件结束时间
	6			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_date_time_s,//转成698之后的数据类型

	0xF2050201,//--负荷开关误动作时状态
	12			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_unsigned,//转成698之后的数据类型
	
	0x00102201,//--负荷开关误动作前正向有功总电能
	13			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

	0x00202201,//--负荷开关误动作前反向有功总电能
	17			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

	0x00108201,//--负荷开关误动作后正向有功总电能
	21			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型

	0x00208201,//--负荷开关误动作后反向有功总电能
	25			,//对应数据在645帧数据域去除数据标识之后的起始位置
	DataType_double_long_unsigned,//转成698之后的数据类型
};

//
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1001FF01[]=
{
	0x10010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1001FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1002FF01[]=
{
	0x10020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1002FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1003FF01[]=
{
	0x10030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1003FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1101FF01[]=
{
	0x11010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1101FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1102FF01[]=
{
	0x11020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1102FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1103FF01[]=
{
	0x11030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1103FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1201FF01[]=
{
	0x12010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1201FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1202FF01[]=
{
	0x12020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1202FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
