gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1203FF01[]=
{
	0x12030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1203FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1301FF01[]=
{
	0x13010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1301FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1302FF01[]=
{
	0x13020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1302FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1303FF01[]=
{
	0x13030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1303FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30000600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30000600),//对应645数据项的OAD顺序列表总字节数
};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1400FF01[]=//上1次电压逆向序记录
{
	0x14000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1400FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1500FF01[]=//上1次电流逆向序记录
{
	0x15000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1500FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1600FF01[]=//上1次电压不平衡记录
{
	0x16000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1600FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301D0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301D0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1700FF01[]=//上1次电流不平衡记录
{
	0x17000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1700FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301D0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301D0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1801FF01[]=//上1次A相失流记录
{
	0x18010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1801FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1802FF01[]=//上1次B相失流记录
{
	0x18020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1802FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1803FF01[]=//上1次C相失流记录
{
	0x18030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1803FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1901FF01[]=//上1次A相过流记录
{
	0x19010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1901FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1902FF01[]=//上1次B相过流记录
{
	0x19020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1902FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1903FF01[]=//上1次C相过流记录
{
	0x19030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1903FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1A01FF01[]=//上1次A相断流记录
{
	0x1A010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1A01FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1A02FF01[]=//上1次B相断流记录
{
	0x1A020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1A02FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1A03FF01[]=//上1次C相断流记录
{
	0x1A030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1A03FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30040600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30040600),//对应645数据项的OAD顺序列表总字节数
};
 		
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1B01FF01[]=//上1次A相电能表功率反向事件
{
	0x1B010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1B01FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
