gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1B02FF01[]=//上1次B相电能表功率反向事件
{
	0x1B020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1B02FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1B03FF01[]=//上1次C相电能表功率反向事件
{
	0x1B030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1B03FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
 			
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1C01FF01[]=//上1次A相过载记录
{
	0x1C010001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1C01FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1C02FF01[]=//上1次B相过载记录
{
	0x1C020001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1C02FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1C03FF01[]=//上1次C相过载记录
{
	0x1C030001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x1C03FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30070600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30070600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1D00FF01[]=//上1次跳闸记录
{
	0x1D000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1D00FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301F0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301F0600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1E00FF01[]=//上1次合闸记录
{
	0x1D000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1D00FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30200600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30200600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_1F00FF01[]=//上1次总功率因素记录
{
	0x1F000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x1F00FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_300C0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_300C0600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_2000FF01[]=//上1次电压不平衡记录
{
	0x20000001,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数
	
	0x2000FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301D0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301D0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03050001[]=//上1次全失压记录
{
	0x03050000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03050001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_300D0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_300D0600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03060001[]=//上1次辅助电源失效记录
{
	0x03060000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03060001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_300E0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_300E0600),//对应645数据项的OAD顺序列表总字节数

};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03110001[]=//上1次掉电记录
{
	0x03110000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03110001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30110600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30110600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120101[]=//上1次正向有功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_1,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_1),//对应645数据项的OAD顺序列表总字节数

	0x03120101,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120201[]=//上1次反向有功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_2,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_2),//对应645数据项的OAD顺序列表总字节数

	0x03120201,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120301[]=//上1次第一象限无功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_3),//对应645数据项的OAD顺序列表总字节数

	0x03120301,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120401[]=//上1次第二象限无功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_4,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_4),//对应645数据项的OAD顺序列表总字节数

	0x03120401,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

