gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120501[]=//上1次第三象限无功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_5,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_5),//对应645数据项的OAD顺序列表总字节数

	0x03120501,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03120601[]=//上1次第四象限无功需量超限记录 
{
	0x03120000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_03120000_6,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_03120000_6),//对应645数据项的OAD顺序列表总字节数

	0x03120601,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30090600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30090600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300001[]=//上1次编程记录
{
	0x03300000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_standard,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_standard),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300101[]=//上1次电表清零记录
{
	0x03300100,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300101,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30130600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30130600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300201[]=//上1次需量清零记录
{
	0x03300200,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300201,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30140600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30140600),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300301[]=//上1次事件清零记录
{
	0x03300300,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300301,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_standard,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_standard),//对应645数据项的OAD顺序列表总字节数

};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300401[]=//上1次校时记录
{
	0x03300400,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300401,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30160600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30160600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300501[]=//上1次时段表编程记录
{
	0x03300500,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300501,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_standard,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_standard),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300601[]=//上1次时区表编程记录
{
	0x03300600,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300601,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30180600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30180600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300701[]=//上1次周休日编程记录
{
	0x03300700,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300701,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30190600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30190600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300801[]=//上1次节假日编程记录
{
	0x03300800,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300801,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301A0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301A0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300901[]=//上1次有功组合方式编程
{
	0x03300900,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300901,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30220600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30220600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300C01[]=//上1次结算日编程记录
{
	0x03300C00,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300D01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301A0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301A0600),//对应645数据项的OAD顺序列表总字节数
};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300D01[]=//上1次开标盖记录
{
	0x03300D00,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300D01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301B0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301B0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300E01[]=//上1次开端钮盖记录
{
	0x03300E00,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300E01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_301B0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_301B0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03300F01[]=//上1次费率表编程记录
{
	0x03300F00,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03300F01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30240600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30240600),//对应645数据项的OAD顺序列表总字节数
};
