gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03301001[]=//上1次阶梯表编程记录
{
	0x03301000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03301001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30250600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30250600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03301201[]=//上1次秘钥更新记录
{
	0x03301200,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03301201,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30260600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30260600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03301301[]=//上1次电能表异常插卡事件记录
{
	0x03301200,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03301201,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30270600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30270600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_0333FF01[]=//上1次购电记录
{
	0x03330000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x0333FF01,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30280600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30280600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03340001[]=//上1次退费记录
{
	0x03340000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03340001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30290600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30290600),//对应645数据项的OAD顺序列表总字节数
};

const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03350001[]=//上1次电能表恒定磁场干扰事件
{
	0x03350000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03350001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_302A0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_302A0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03360001[]=//上1次电能表负荷开关误动作事件
{
	0x03360000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03360001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_302B0600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_302B0600),//对应645数据项的OAD顺序列表总字节数
};
const RM_EventLIB_DL645_typedef RM_EventLIB_DL645_03370001[]=//上1次电原异常记录
{
	0x03370000,//对应645事件的总次数,0表示空
	(u32*)RM_EventLIB_OAD645_20220200_3,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_20220200_3),//对应645数据项的OAD顺序列表总字节数

	0x03370001,//对应645最近1次事件的DI,0表示空
	(u32*)RM_EventLIB_OAD645_30110600,//对应645数据项的OAD顺序列表
	sizeof(RM_EventLIB_OAD645_30110600),//对应645数据项的OAD顺序列表总字节数
};


//属性10 当前值记录表∷=array structure
//{
//事件发生次数 double-long-unsigned，
//事件累计时间 double-long-unsigned 
//}
//const u32 RM_EventLIB_OAD698_30000A00[]=//事件OAD顺序列表
//{
//	0x20220200,//事件发生次数 double-long-unsigned，
//	0,//事件累计时间 double-long-unsigned 
//};




//const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30000A00[]=//645数据项的OAD顺序列表
//{
//	
//};
//属性13（失压统计）∷=structure
//{
//事件发生总次数   double-long-unsigned，
//事件总累计时间   double-long-unsigned（单位：秒，无换算），
//最近一次失压发生时间 date_time_s，
//最近一次失压结束时间 date_time_s
//}
//const u32 RM_EventLIB_OAD698_30000D00[]=//事件OAD顺序列表
//{
//	
//};
//const RM_EventLIB_OAD645_typedef RM_EventLIB_OAD645_30000D00[]=//645数据项的OAD顺序列表
//{
//	
//};



const RM_EventLIB_typedef RM_EventLIB[]=
{
	
//A相失压
	0x30000700,//事件OAD
	0x10010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1001FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1001FF01),//对应DL645表总长度字节数
//B相失压
	0x30000800,//事件OAD
	0x10020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1002FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1002FF01),//对应DL645表总长度字节数
//C相失压	
	0x30000900,//事件OAD
	0x10030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1003FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1003FF01),//对应DL645表总长度字节数

//A相欠压
	0x30010700,//事件OAD
	0x11010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1101FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1101FF01),//对应DL645表总长度字节数
//B相欠压
	0x30010800,//事件OAD
	0x11020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1102FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1102FF01),//对应DL645表总长度字节数
//C相欠压	
	0x30010900,//事件OAD
	0x11030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1103FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1103FF01),//对应DL645表总长度字节数

//A相过压
	0x30020700,//事件OAD
	0x12010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1201FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1201FF01),//对应DL645表总长度字节数
//B相过压
	0x30020800,//事件OAD
	0x12020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1202FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1202FF01),//对应DL645表总长度字节数
//C相过压	
	0x30020900,//事件OAD
	0x12030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1203FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1203FF01),//对应DL645表总长度字节数

//A相断项
	0x30030700,//事件OAD
	0x13010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1301FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1301FF01),//对应DL645表总长度字节数
//B相断项
	0x30030800,//事件OAD
	0x13020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1302FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1302FF01),//对应DL645表总长度字节数
//C相断项	
	0x30030900,//事件OAD
	0x13030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1303FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1303FF01),//对应DL645表总长度字节数


//A相失流
	0x30040700,//事件OAD
	0x18010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1801FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1801FF01),//对应DL645表总长度字节数
//B相失流
	0x30040800,//事件OAD
	0x18020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1802FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1802FF01),//对应DL645表总长度字节数
//C相失流	
	0x30040900,//事件OAD
	0x18030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1803FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1803FF01),//对应DL645表总长度字节数

//A相过流
	0x30050700,//事件OAD
	0x19010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1901FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1901FF01),//对应DL645表总长度字节数
//B相过流
	0x30050800,//事件OAD
	0x19020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1902FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1902FF01),//对应DL645表总长度字节数
//C相过流	
	0x30050900,//事件OAD
	0x19030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1903FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1903FF01),//对应DL645表总长度字节数

//A相断流	
	0x30060700,//事件OAD
	0x1A010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1A01FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1A01FF01),//对应DL645表总长度字节数
//B相断流
	0x30060800,//事件OAD
	0x1A020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1A02FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1A02FF01),//对应DL645表总长度字节数
//C相断流	
	0x30060900,//事件OAD
	0x1A030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1A03FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1A03FF01),//对应DL645表总长度字节数

//A相电能表功率反向事件
	0x30070700,//事件OAD
	0x1B010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1B01FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1B01FF01),//对应DL645表总长度字节数
//B相电能表功率反向事件
	0x30070800,//事件OAD
	0x1B020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1B02FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1B02FF01),//对应DL645表总长度字节数
//C相电能表功率反向事件
	0x30070900,//事件OAD
	0x1B030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1B03FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1B03FF01),//对应DL645表总长度字节数


//A相过载	
	0x30080700,//事件OAD
	0x1C010001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1C01FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1C01FF01),//对应DL645表总长度字节数
//B相过载
	0x30080800,//事件OAD
	0x1C020001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1C02FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1C02FF01),//对应DL645表总长度字节数
//C相过载	
	0x30080900,//事件OAD
	0x1C030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1C03FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1C03FF01),//对应DL645表总长度字节数


//电能表正向有功需量超限事件
	0x30090200,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120101,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120101),//对应DL645表总长度字节数


