gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
//电能表反向有功需量超限事件
	0x300A0200,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	3,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120201,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120201),//对应DL645表总长度字节数

//电能表第一象限无功需量超限事件
	0x300B0600,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	6,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120301,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120301),//对应DL645表总长度字节数

//电能表第二象限无功需量超限事件	
	0x300B0700,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	9,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120401,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120401),//对应DL645表总长度字节数
//电能表第三象限无功需量超限事件
	0x300B0800,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	12,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120501,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120501),//对应DL645表总长度字节数
//电能表第四象限无功需量超限事件	
	0x300B0900,//事件OAD
	0x03120000,//对应抄读645次数的DI,0表示空
	15,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03120601,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03120601),//对应DL645表总长度字节数

//电能表功率因数超下限事件
	0x300C0200,//事件OAD
	0x1F000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1F00FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1F00FF01),//对应DL645表总长度字节数

//电能表全失压事件 300D
	0x300D0200,//事件OAD
	0x03050000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03050001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03050001),//对应DL645表总长度字节数

//电能表辅助电源掉电事件 300E
	0x300E0200,//事件OAD
	0x03060000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03060001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03060001),//对应DL645表总长度字节数

//电能表电压逆相序事件
	0x300F0200,//事件OAD
	0x14000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1400FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1400FF01),//对应DL645表总长度字节数

//电能表电流逆相序事件
	0x30100200,//事件OAD
	0x15000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1500FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1500FF01),//对应DL645表总长度字节数

//电能表掉电事件
	0x30110200,//事件OAD
	0x03110000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03110001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03110001),//对应DL645表总长度字节数

//电能表编程事件 3012
	0x30120200,//事件OAD
	0x03300000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300001),//对应DL645表总长度字节数

//电能表清零事件
	0x30130200,//事件OAD
	0x03300100,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300101,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300101),//对应DL645表总长度字节数

//电能表需量清零事件
	0x30140200,//事件OAD
	0x03300200,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300201,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300201),//对应DL645表总长度字节数

//电能表事件清零事件
	0x30150200,//事件OAD
	0x03300300,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300301,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300301),//对应DL645表总长度字节数

//电能表校时事件
	0x30160200,//事件OAD
	0x03300400,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300401,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300401),//对应DL645表总长度字节数

//电能表时段表编程事件
	0x30170200,//事件OAD
	0x03300500,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300501,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300501),//对应DL645表总长度字节数

//电能表时区表编程事件
	0x30180200,//事件OAD
	0x03300600,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300601,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300601),//对应DL645表总长度字节数

//电能表周休日编程事件
	0x30190200,//事件OAD
	0x03300700,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300701,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300701),//对应DL645表总长度字节数

//电能表结算日编程事件 301A
	0x301A0200,//事件OAD
	0x03300C00,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300C01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300C01),//对应DL645表总长度字节数

//电能表开盖事件
	0x301B0200,//事件OAD
	0x03300D00,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300D01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300D01),//对应DL645表总长度字节数

//电能表开端钮盒事件
	0x301C0200,//事件OAD
	0x03300E00,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300E01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300E01),//对应DL645表总长度字节数

//电能表电压不平衡事件
	0x301D0200,//事件OAD
	0x16000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1600FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1600FF01),//对应DL645表总长度字节数


//电能表电流不平衡事件
	0x301E0200,//事件OAD
	0x17000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1700FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1700FF01),//对应DL645表总长度字节数

//电能表跳闸事件
	0x301F0200,//事件OAD
	0x1D000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1D00FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1D00FF01),//对应DL645表总长度字节数

//电能表合闸事件
	0x30200200,//事件OAD
	0x1E000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1E00FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1E00FF01),//对应DL645表总长度字节数

//电能表节假日编程事件 3021 
	0x30210200,//事件OAD
	0x03300800,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300801,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300801),//对应DL645表总长度字节数

//电能表有功组合方式编程事件
	0x30220200,//事件OAD
	0x03300900,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300901,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300901),//对应DL645表总长度字节数

//电能表无功组合方式编程事件 3023
//电能表费率参数表编程事件 3024
	0x30240200,//事件OAD
	0x03300F00,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03300F01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03300F01),//对应DL645表总长度字节数

//电能表阶梯表编程事件 3025
	0x30250200,//事件OAD
	0x03301000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03301001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03301001),//对应DL645表总长度字节数

