gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
//电能表密钥更新事件 3026
	0x30260200,//事件OAD
	0x03301200,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03301201,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03301201),//对应DL645表总长度字节数

//电能表异常插卡事件 3027
	0x30270200,//事件OAD
	0x03301300,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03301301,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03301301),//对应DL645表总长度字节数

//电能表购电记录 3028
	0x30280200,//事件OAD
	0x03330000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_0333FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_0333FF01),//对应DL645表总长度字节数

//电能表退费记录 3029
	0x30290200,//事件OAD
	0x03340000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03340001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03340001),//对应DL645表总长度字节数

//电能表恒定磁场干扰事件 302A
	0x302A0200,//事件OAD
	0x03350000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03350001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03350001),//对应DL645表总长度字节数

//电能表负荷开关误动作事件 302B
	0x302B0200,//事件OAD
	0x03360000,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03360001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03360001),//对应DL645表总长度字节数

//电能表电源异常事件 302C
	0x302C0200,//事件OAD
	0x20000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_03370001,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_03370001),//对应DL645表总长度字节数

//电能表电流严重不平衡事件 
	0x302D0200,//事件OAD
	0x20000001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_2000FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_2000FF01),//对应DL645表总长度字节数


//电能表时钟故障事件 302E
//电能表计量芯片故障事件 302F

//
//
//
//
//
//
//
//
//
//

//当前值记录表


	
//失压统计
/*
	0x30000D00,//事件OAD
	(u32*)RM_EventLIB_OAD698_3000,//标准698的OAD列表
	sizeof(RM_EventLIB_OAD698_3000),//标准698的OAD列表总字节数
	0x10030001,//对应抄读645次数的DI,0表示空
	0,//抄读的645次数在帧中偏移字节数
	3,//抄读的645次数有效字节数
	(u32*)RM_EventLIB_DL645_1003FF01,//对应645最近1次事件的DI,0表示空
	sizeof(RM_EventLIB_DL645_1003FF01),//对应DL645表总长度字节数
*/
	
	
};


u32 Get_Datatype_date_time_s(u8* psour,u8* pdest)//把YYMMDDhhmmss转成698格式date_time_s  返回长度
{
	u32 index=0;
	if((psour==0)&&(pdest==0))
		return 8;
	pdest[index++]=DataType_date_time_s;
	pdest[index++]=(bcd_hex(psour[5])+2000)>>8;
	pdest[index++]=(bcd_hex(psour[5])+2000)&0xff;
	pdest[index++]=bcd_hex(psour[4]);
	pdest[index++]=bcd_hex(psour[3]);
	pdest[index++]=bcd_hex(psour[2]);
	pdest[index++]=bcd_hex(psour[1]);
	pdest[index++]=bcd_hex(psour[0]);
	return index;
}
//需量清零事件，YYMMDDhhmm 格式的转date_time_s
u32 Get_Datatype_date_time_5type(u8* psour,u8* pdest)//把YYMMDDhhmm 格式的转date_time_s格式，返回长度
{
	u32 index=0;
	if((psour==0)&&(pdest==0))
		return 8;
	pdest[index++]=DataType_date_time_s;
	pdest[index++]=(bcd_hex(psour[4])+2000)>>8;
	pdest[index++]=(bcd_hex(psour[4])+2000)&0xff;
	pdest[index++]=bcd_hex(psour[3]);
	pdest[index++]=bcd_hex(psour[2]);
	pdest[index++]=bcd_hex(psour[1]);
	pdest[index++]=bcd_hex(psour[0]);
	pdest[index++]=0;
	return index;
}
//645事件记录里没有结束时间，但698又要求，产生一个数据是无效数据的
u32 Get_Datatype_date_time_s_null(u8* psour,u8* pdest)//把YYMMDDhhmm 格式的转date_time_s格式，返回长度
{
	u32 index=0;
	if((psour==0)&&(pdest==0))
		return 8;
	pdest[index++]=DataType_date_time_s;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	pdest[index++]=0xff;
	return index;
}

u32 Get_Datatype_double_long_unsigned(u8* psour,u8* pdest)//把645的4字节电能量格式转成698的0x06格式，返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 5;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100)+(bcd_hex(psour[2])*10000)+(bcd_hex(psour[3])*1000000);
	pdest[index++]=DataType_double_long_unsigned;
	pdest[index++]=(value>>24)&0xff;
	pdest[index++]=(value>>16)&0xff;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}
u32 Get_Datatype_double_long_unsigned_3byte(u8* psour,u8* pdest)//把645的3字节次数转成698的0x06格式，返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 5;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100)+(bcd_hex(psour[2])*10000);
	pdest[index++]=DataType_double_long_unsigned;
	pdest[index++]=(value>>24)&0xff;
	pdest[index++]=(value>>16)&0xff;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}
//购电次数 645里是2字节  698里是double_long_unsigned
u32 Get_Datatype_double_long_unsigned_2byte(u8* psour,u8* pdest)//把645的3字节次数转成698的0x06格式，返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 5;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100);
	pdest[index++]=DataType_double_long_unsigned;
	pdest[index++]=(value>>24)&0xff;
	pdest[index++]=(value>>16)&0xff;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}

//电流XXX.XXX 有功功率XX.XXXX 无功功率XX.XXXX会用到double_long 
u32 Get_Datatype_double_long(u8* psour,u8* pdest)
{
	u32 index=0;
	vs32 value=0;
	if((psour==0)&&(pdest==0))
		return 5;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100)+(bcd_hex(psour[2]&0x7f)*10000);
	if((psour[2]&0x80)==0x80)
	{
		value*=-1;
	}
	pdest[index++]=DataType_double_long;
	pdest[index++]=(value>>24)&0xff;
	pdest[index++]=(value>>16)&0xff;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}
u32 Get_Datatype_Unbalance(u8* psour,u8* pdest)////电压，电流不平衡 XXXX.XX转成 long-unsigned格式 返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 3;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100)+(bcd_hex(psour[2])*100);
	pdest[index++]=DataType_long_unsigned;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}

u32 Get_Datatype_long_unsigned(u8* psour,u8* pdest)//把645的2字节格式转成698的0x12格式，返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 3;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1])*100);
	pdest[index++]=DataType_long_unsigned;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}
u32 Get_Datatype_unsigned(u8* psour,u8* pdest)//把645的1字节格式转成698的0x11格式，返回长度
{
	u32 index=0;
	u32 value=0;
	if((psour==0)&&(pdest==0))
		return 2;
	value=bcd_hex(psour[0]);
	pdest[index++]=DataType_unsigned;
	pdest[index++]=value&0xff;
	return index;
}

//功率因素X.XXX会用到 long
u32 Get_Datatype_long(u8* psour,u8* pdest)//把645的2字节格式转成698的0x06格式，返回长度
{
	u32 index=0;
	vs32 value=0;
	if((psour==0)&&(pdest==0))
		return 3;
	value=bcd_hex(psour[0])+(bcd_hex(psour[1]&0x7f)*100);
	if((psour[1]&0x80)==0x80)
	{
		value*=-1;
	}	
	pdest[index++]=DataType_long;
	pdest[index++]=(value>>8)&0xff;
	pdest[index++]=value&0xff;
	return index;
}
u32 Get_Datatype_null(u8* psour,u8* pdest)//把645的2字节格式转成698的0x06格式，返回长度
{
	u32 index=0;
	if((psour==0)&&(pdest==0))
		return 1;
	pdest[index++]=DataType_NULL;
	return index;
}
u32 Get_Datatype_bit_string(u8* psour,u8* pdest)//把645的2字节格式转成698的0x06格式，返回长度
{
	u32 index=0;
	if((psour==0)&&(pdest==0))
		return 3;
	pdest[index++]=DataType_bit_string;
	pdest[index++]=8;
	pdest[index++]=psour[0];
	return index;
}

u32 Change_Datatype_645_to_698(u32 Datatype,u8 *psour,u8 *pdest)//根据数据类型 Datatype 把原始数据psour转成目标数据pdest,返回转换成功后的数据长度，失败返回0
{
	switch(Datatype)
	{
		case DataType_date_time_s:
			return Get_Datatype_date_time_s(psour,pdest);//把YYMMDDhhmmss转成698格式date_time_s  返回长度
		case DataType_date_time_5byte:
			return Get_Datatype_date_time_5type(psour,pdest);//把YYMMDDhhmm 格式的转date_time_s格式，返回长度
		case DataType_double_long:
			return Get_Datatype_double_long(psour,pdest);
		case DataType_double_long_unsigned:
			return Get_Datatype_double_long_unsigned(psour,pdest);
		case DataType_double_long_unsigned_3byte:
			return Get_Datatype_double_long_unsigned_3byte(psour,pdest);
		case DataType_long:
			return Get_Datatype_long(psour,pdest);
		case DataType_long_unsigned:
			return Get_Datatype_long_unsigned(psour,pdest);
		case DataType_Unbalance:
			return Get_Datatype_Unbalance(psour,pdest);
		case DataType_NULL:
			return Get_Datatype_null(psour,pdest);
		case DataType_date_time_s_null:
			return Get_Datatype_date_time_s_null(psour,pdest);
		case DataType_bit_string:
			return Get_Datatype_bit_string(psour,pdest);
		case DataType_double_long_unsigned_2byte:
			return Get_Datatype_double_long_unsigned_2byte(psour,pdest);
		case DataType_unsigned:
			return Get_Datatype_unsigned(psour,pdest);
		default:
			return 0;
	}
}

