gdgly/NUC97X_JS/STM32F4xx/DL698/RM_EventLIB.c
RM_EventLIB_typedef Get_EventLIB(u32 OAD)//根据OAD找到对应的事件库，并返回事件库。
{
	u32 num_lib;
	u32 index;
	u8 *p_lib;
	RM_EventLIB_typedef st_RM_EventLIB;
	st_RM_EventLIB.OAD=NO_SUCH_OAD;
	num_lib=sizeof(RM_EventLIB)/sizeof(RM_EventLIB_typedef);
	p_lib=(u8 *)RM_EventLIB;
	for(index=0;index<num_lib;index++)
	{
		st_RM_EventLIB.OAD=p_lib[0]|(p_lib[1]<<8)|(p_lib[2]<<16)|(p_lib[3]<<24);
		if(st_RM_EventLIB.OAD==OAD)
		{
			st_RM_EventLIB.DInum=p_lib[4]|(p_lib[5]<<8)|(p_lib[6]<<16)|(p_lib[7]<<24);
			st_RM_EventLIB.DInum_offset=p_lib[8];
			st_RM_EventLIB.DInum_byte=p_lib[9];
			st_RM_EventLIB.DL645=(u32*)(p_lib[10]|(p_lib[11]<<8)|(p_lib[12]<<16)|(p_lib[13]<<24));
			st_RM_EventLIB.LEN_DL645=p_lib[14];
			break;
		}
		p_lib+=sizeof(RM_EventLIB_typedef);
	}
	if(index>=num_lib)
	{
		st_RM_EventLIB.OAD=NO_SUCH_OAD;
	}
	return st_RM_EventLIB;
}

u32 Get_Event645_DI(u32 OAD,u32 index)//获取当前的抄645表的数据项，OAD=事件OAD，index=当前OAD对应的第几个数据表示，从0开始，返回0=没有要抄读的数据标识
{
	u32 num;
	u8 *p_lib;
	RM_EventLIB_typedef st_RM_EventLIB;//当前抄表库
	st_RM_EventLIB=Get_EventLIB(OAD);
	if(st_RM_EventLIB.OAD==NO_SUCH_OAD)//没有对应的事件库
	{
		return 0;
	}
	num=st_RM_EventLIB.LEN_DL645/sizeof(RM_EventLIB_DL645_typedef);//计算得到抄表项的总个数
	p_lib=(u8 *)st_RM_EventLIB.DL645;
	if((index+1)>num)//序号大于总个数，不要抄了。
		return 0;
	p_lib+=index*sizeof(RM_EventLIB_DL645_typedef);
	return p_lib[0]|(p_lib[1]<<8)|(p_lib[2]<<16)|(p_lib[3]<<24);
}

//完成一个完整的事件采集方案的记录，645表基本上都要两帧数据抄读才能实现，一帧是事件总次数，一帧是事件记录
//pdest格式: 
//第一次 01 30 04 06 00 01 20 22 02 00 01 01 01 01 06 00 00 00 00 就记录了一个 3004 的 事件记录序号
//第二次 01 30 04 06 00 03 20 22 02 00 20 1E 02 00 20 20 02 00 01 01 01 03 06 00 00 00 00 1C 07 E1 05 1A 17 32 00 1C 07 E1 05 1A 17 37 00 补充了 3004 的 发生时间和结束时间
//第二次进入是需把第一次的数据带进来，pdest_len是数据长度

//存放约定
//ADDR_DATABUFF+0K  01 ROAD-4 N OAD-1 OAD-2 OAD-N
//ADDR_DATABUFF+1K  01 01 01 N 12 XX XX 06 XX XX XX XX 1C XX XX XX XX XX XX XX 
//
//N的数字必须是列选数据找到了再+1，数字部分都是死的
//列选完成了 在把 ADDR_DATABUFF+0K   ADDR_DATABUFF+1K 接起来 放到 pdest
u32 Change_Frame_645_to_698(u32 PORTn)//把645的事件数据帧转成698格式,
{
	#if (LEN_DATABUFF<2048)
	#error LEN_DATABUFF Over
	#endif
	UARTCtrl_TypeDef * UARTCtrl;
	u8 *psour;//指向UARTCtrl的接收缓冲区
	u8 *pdest;//指向筛选结果存放区
	u32 LEN_RxDataBuff;//结果存放缓冲区可用长度
	u32 i;
	u32 j;
	u32 k,m,n;
	u32 index=0;
	u32 pos_head=0;//ADDR_DATABUFF+2K部分使用长度
	u32 pos_data=0;//ADDR_DATABUFF+3K部分使用长度
	u8 *p_lib;
	u8 *p_databuf=(u8 *)ADDR_DATABUFF;
	u32 OAD;
	u32 num;
	u16* p16Data;
	RM_EventLIB_typedef st_RM_EventLIB;//当前抄表库
	RM_EventLIB_DL645_typedef st_RM_EventLIB_DL645;//
	RM_EventLIB_OAD645_typedef st_RM_EventLIB_OAD645;
	RM_EventLIB_OAD645_typedef st_RM_EventLIB_OAD645_1;//嵌套第一层
	RM_EventLIB_OAD645_typedef st_RM_EventLIB_OAD645_2;//嵌套第二层
	RM_EventLIB_OAD645_typedef st_RM_EventLIB_OAD645_3;//嵌套第三层

	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	psour=(u8 *)Get_ADDR_UARTnRx(PORTn);

	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);//减去已经固定使用的长度
	pdest=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
	p16Data=(u16*)(pdest+LEN_RM_DI_CSD);
	i=p16Data[1];//已填写入buff完整CSD的数据长度(不包括本身2字节)
	if(LEN_RxDataBuff<i)//错
	{
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	LEN_RxDataBuff-=i;
	pdest+=LEN_RM_DI_CSD+4+i;

	i=p16Data[0];//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	if(LEN_RxDataBuff<i)//错
	{
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	LEN_RxDataBuff-=i;

	
	if(UARTCtrl->RMCSD[1]==0)//非ROAD错
	{
		return 0;
	}
	if(UARTCtrl->RMCSD[6]==0)//关联OAD个数是0，不需要列选
	{
		return 0;
	}
	OAD=UARTCtrl->RMCSD[5]|(UARTCtrl->RMCSD[4]<<8)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[2]<<24);
	st_RM_EventLIB=Get_EventLIB(OAD);
	if(st_RM_EventLIB.OAD==NO_SUCH_OAD)//没有对应的事件库
	{
		return 0;
	}
	
	num=st_RM_EventLIB.LEN_DL645/sizeof(RM_EventLIB_DL645_typedef);//计算得到抄表项的总个数
	p_lib=(u8 *)st_RM_EventLIB.DL645;
	for(index=0;index<num;index++)//根据当前的645抄表数据标识，找到该数据标识可以包含的关联OAD的数据
	{
		st_RM_EventLIB_DL645.DI=p_lib[0]|(p_lib[1]<<8)|(p_lib[2]<<16)|(p_lib[3]<<24);
		if(st_RM_EventLIB_DL645.DI==UARTCtrl->RM_DI)
		{
			st_RM_EventLIB_DL645.OAD645=(u32*)(p_lib[4]|(p_lib[5]<<8)|(p_lib[6]<<16)|(p_lib[7]<<24));
			st_RM_EventLIB_DL645.LEN_OAD645=p_lib[8]|(p_lib[9]<<8); 
			break;
		}
		p_lib+=sizeof(RM_EventLIB_DL645_typedef);
	}
	if(index>=num)//抄表的数据标识居然不在库里，出错了
	{
		return 0;
	}
	//到这就说明当前抄读的645的数据标识有对应的列选库
	//根据UARTCtrl->RMCSD的关联OAD，从数据帧中列选出数据

	//从pdest里提取出之前的数据，分别存放到ADDR_DATABUFF+0K   ADDR_DATABUFF+1K
	if(p16Data[0]==0)//说明是第一次的事件总次数
	{
		for(index=0;index<5;index++)
		{
			p_databuf[index+0*1024]=UARTCtrl->RMCSD[index+1];
		}
		p_databuf[5+0*1024]=0;//目前关联OAD个数为0
		pos_head=6;
		
		p_databuf[0+1*1024]=0x02;
		p_databuf[1+1*1024]=0x00;//目前关联OAD的数据个数为0
		pos_data=2+1*1024;
	}
	else//不是第一次了，
	{
		pos_head=pdest[5]*4+6;//pdest[5] 关联OAD个数
		MR(ADDR_DATABUFF+0*1024,(u32)pdest,pos_head);
		pos_data=p16Data[0]-pos_head;
		MR(ADDR_DATABUFF+1*1024,(u32)pdest+pos_head,pos_data);
		pos_data+=1*1024;
	}
	for(j=0;j<UARTCtrl->RMCSD[6];j++)
	{
		OAD=UARTCtrl->RMCSD[10+4*j]|(UARTCtrl->RMCSD[9+4*j]<<8)|(UARTCtrl->RMCSD[8+4*j]<<16)|(UARTCtrl->RMCSD[7+4*j]<<24);//得到ROAD的关联OAD
		p_lib=(u8 *)st_RM_EventLIB_DL645.OAD645;
		num=st_RM_EventLIB_DL645.LEN_OAD645/sizeof(RM_EventLIB_OAD645_typedef);
		for(index=0;index<num;index++)
		{
			st_RM_EventLIB_OAD645.OAD=p_lib[0]|(p_lib[1]<<8)|(p_lib[2]<<16)|(p_lib[3]<<24);
			if(st_RM_EventLIB_OAD645.OAD==OAD)//该645数据帧里有ROAD的列选OAD，读出数据
			{
				p_databuf[5+0*1024]+=1;//目前关联OAD个数加1
				for(k=0;k<4;k++)//填充OAD
				{
					p_databuf[pos_head+0*1024]=p_lib[3-k];
					pos_head+=1;
				}
				p_databuf[1+1*1024]+=1;//目前关联OAD的数据个数加1
				st_RM_EventLIB_OAD645.Byte=p_lib[4];
				st_RM_EventLIB_OAD645.DataType=p_lib[5];
				if((st_RM_EventLIB_OAD645.DataType==DataType_array)||(st_RM_EventLIB_OAD645.DataType==DataType_structure))//如果该关联OAD的数据的类 或 结构体的，先放类型和成员个数
				{//这种结构是会嵌套的，但最多3层，出现在阶梯表编程记录
					p_databuf[pos_data++]=st_RM_EventLIB_OAD645.DataType;//数据类型
					p_databuf[pos_data++]=st_RM_EventLIB_OAD645.Byte;//成员个数
					for(k=0;k<st_RM_EventLIB_OAD645.Byte;k++)//根据成员个数紧跟着补充成员数据
					{
						p_lib+=sizeof(RM_EventLIB_OAD645_typedef);
						st_RM_EventLIB_OAD645_1.Byte=p_lib[4];
						st_RM_EventLIB_OAD645_1.DataType=p_lib[5];
						if((st_RM_EventLIB_OAD645_1.DataType==DataType_array)||(st_RM_EventLIB_OAD645_1.DataType==DataType_structure))
						{
							p_databuf[pos_data++]=st_RM_EventLIB_OAD645_1.DataType;//数据类型
							p_databuf[pos_data++]=st_RM_EventLIB_OAD645_1.Byte;//成员个数
							for(m=0;m<st_RM_EventLIB_OAD645_1.Byte;m++)//根据成员个数紧跟着补充成员数据
							{
								p_lib+=sizeof(RM_EventLIB_OAD645_typedef);
								st_RM_EventLIB_OAD645_2.Byte=p_lib[4];
								st_RM_EventLIB_OAD645_2.DataType=p_lib[5];
								if((st_RM_EventLIB_OAD645_2.DataType==DataType_array)||(st_RM_EventLIB_OAD645_2.DataType==DataType_structure))
								{
									p_databuf[pos_data++]=st_RM_EventLIB_OAD645_2.DataType;//数据类型
									p_databuf[pos_data++]=st_RM_EventLIB_OAD645_2.Byte;//成员个数
									for(n=0;n<st_RM_EventLIB_OAD645_2.Byte;n++)//根据成员个数紧跟着补充成员数据
									{
										p_lib+=sizeof(RM_EventLIB_OAD645_typedef);
										st_RM_EventLIB_OAD645_3.Byte=p_lib[4];
										st_RM_EventLIB_OAD645_3.DataType=p_lib[5];
										i=Change_Datatype_645_to_698(st_RM_EventLIB_OAD645_3.DataType,psour+14+st_RM_EventLIB_OAD645.Byte,p_databuf+pos_data);
										if(i==0)
										{
											i=Change_Datatype_645_to_698(DataType_NULL,psour,p_databuf+pos_data);
											pos_data+=i;
										}
										else
										{
											pos_data+=i;
										}
									}
								}
								else
								{
									i=Change_Datatype_645_to_698(st_RM_EventLIB_OAD645_2.DataType,psour+14+st_RM_EventLIB_OAD645_2.Byte,p_databuf+pos_data);
									if(i==0)
									{
										i=Change_Datatype_645_to_698(DataType_NULL,psour,p_databuf+pos_data);
										pos_data+=i;
									}
									else
									{
										pos_data+=i;
									}
								}
							}
						}
						else
						{
							i=Change_Datatype_645_to_698(st_RM_EventLIB_OAD645_1.DataType,psour+14+st_RM_EventLIB_OAD645_1.Byte,p_databuf+pos_data);
							if(i==0)
							{
								i=Change_Datatype_645_to_698(DataType_NULL,psour,p_databuf+pos_data);
								pos_data+=i;
							}
							else
							{
								pos_data+=i;
							}
						}
					}
				}
				else
				{
					i=Change_Datatype_645_to_698(st_RM_EventLIB_OAD645.DataType,psour+14+st_RM_EventLIB_OAD645.Byte,p_databuf+pos_data);
					if(i==0)
					{
						i=Change_Datatype_645_to_698(DataType_NULL,psour,p_databuf+pos_data);
						pos_data+=i;
					}
					else
					{
						pos_data+=i;
					}
				}
				break;
			}
			else
			{
				p_lib+=sizeof(RM_EventLIB_OAD645_typedef);
			}
		}
	}
	if((pos_head+(pos_data-1*1024))>LEN_RxDataBuff)
		return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	if(p16Data[0]==0)
	{
		MW(ADDR_DATABUFF+0*1024,(u32)pdest,pos_head);
		MW(ADDR_DATABUFF+1*1024,(u32)pdest+pos_head,(pos_data-1*1024));
		p16Data[0]=(pos_head+(pos_data-1*1024));
	}
	else//抄完了，需要把数据按RMCSD的顺排列好，放到pdest的地方去
	{
		m=0;
		for(j=0;j<UARTCtrl->RMCSD[6];j++)
		{
			OAD=UARTCtrl->RMCSD[10+4*j]|(UARTCtrl->RMCSD[9+4*j]<<8)|(UARTCtrl->RMCSD[8+4*j]<<16)|(UARTCtrl->RMCSD[7+4*j]<<24);//得到ROAD的关联OAD
			for(i=0;i<p_databuf[5+0*1024];i++)
			{
				k=p_databuf[9+4*i]|(p_databuf[8+4*i]<<8)|(p_databuf[7+4*i]<<16)|(p_databuf[6+4*i]<<24);//得到ROAD的关联OAD
				if(k==OAD)
				{
					p_lib=Get_Element((u8 *)(ADDR_DATABUFF+1*1024),i+1,0,0);
					if(p_lib==0)
					{
						MWR(0,(u32)pdest+m,1);
						m+=1;
					}
					else
					{
						n=Change_Datatype_645_to_698(p_lib[0],0,0);
						MW((u32)p_lib,(u32)pdest+m,n);
						m+=n;
					}
					break;
				}
			}
			if(i>=p_databuf[5+0*1024])
			{
				MWR(0,(u32)pdest+m,1);
				m+=1;
			}
		}
		p16Data[0]=m;
	}
	return 0;
}









